public class Main {
    public static void main(String[] args) {
        //Задание 1
        int clientOS=0;
        switch (clientOS){
            case 0:
                System.out.println("Устаовите версию приложения для IOS поссылке");
            case 1:
                System.out.println("Установите версию приложения для Android по ссылке");
        }
        //Задание2


    }
}